# GroundConductorSize Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroundConductorSize Class
Members See Also
---
Represents electrical ground conductor size definition information.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class GroundConductorSize : APIObject
```

Visual Basic
---
```text
Public Class GroundConductorSize _
	Inherits APIObject
```

Visual C++
---
```text
public ref class GroundConductorSize : public APIObject
```

# Remarks
Ground conductor size is defined based on corresponding wire material type.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..GroundConductorSize
# See Also
GroundConductorSize Members
Autodesk.Revit.DB.Electrical Namespace